---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCPartialSchemaSupport
source: html/65a99147-4571-7ad1-e62b-d1f48c678071.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCPartialSchemaSupport Property

IFC versions 4 and above are only partially supported by Open IFC. Consider using Link IFC instead.

## Syntax (C#)
```csharp
public static FailureDefinitionId IFCPartialSchemaSupport { get; }
```